@ECHO OFF
setlocal enabledelayedexpansion
REM ====================================================================
REM
REM INIファイルからバージョン番号を取得しサーバーへのパスを作ってインストーラーをコピーする
REM
REM ※注意事項：①バッチファイルと同じディレクトリにINIファイルがあること
REM             ②INIファイル名はバッチファイルと同じであること
REM
REM
REM ====================================================================

REM ------------------------------------------------
REM INIファイル名を取得
REM ------------------------------------------------
REM INIファイル名のセット
Set INIFILE=version.ini

REM ------------------------------------------------
REM サブルーチン：GET-INIの呼び出し
REM ------------------------------------------------
call :GET_INI "Version" "InternalVer" INI_GET_VERSION %INIFILE%

REM ------------------------------------------------
REM コピー先のパスの生成
REM ------------------------------------------------
echo INI_GET_VERSION=%INI_GET_VERSION%

set DIR1=\\adtekfuji_sv01\Products\ソフト設計課\2014\AS0001～AS0020\AS0003 Smart Factory System 要求分析\納品物\installer\v
echo %DIR1%
set DIR2=\*.*
echo %DIR2%
set DIR3=%DIR1%%INI_GET_VERSION%%DIR2%

echo DIST_PATH=%DIR3%

REM ------------------------------------------------
REM インストーラをサーバーの所定の場所へコピーする
REM ------------------------------------------------
cd Output

set TEMP="COMMAND = COPY /Y *.exe "
set SHOW_TEMP=%TEMP%%DIR3%
echo %SHOW_TEMP%

COPY /Y "*.exe" "%DIR3%"


REM ------------------------------------------------
REM 終了
REM ------------------------------------------------
GOTO EOF:


:GET_INI
REM ====================================================================
REM INIファイルから項目を読み取り返す
REM     %1:   セクション名
REM     %2:   キー名
REM     %3    取得変数名
REM     %4:   INIファイル名
REM
REM   ※キーを取得できない場合は、取得変数に「ERR」を返す
REM
REM ====================================================================
 
REM ------------------------------------------------
REM ファイルを１行ずつ読み出して、検索
REM ------------------------------------------------
 
set TempStr=
set SN=
for /f "usebackq eol=; delims== tokens=1,2" %%a in (%4) do (
   set V=%%a&set P=!V:~0,1!!V:~-1,1!&set S=!V:~1,-1!
   if "!P!"=="[]" set SN=!S!
   if "!SN!"=="%~1" if "!V!"=="%~2" (
      set TempStr=%%b
      echo TempStr=%TempStr%
      goto GET_INI_EXIT
   )
)
REM ------------------------------------------------
REM 項目が見つからない場合は、「ERR」を変数へ入力
REM ------------------------------------------------
set TempStr=ERR
 
:GET_INI_EXIT
REM ------------------------------------------------
REM 取得変数名に入力
REM ------------------------------------------------
 
set %3=%TempStr%
 
:EOF
